In [2]:
import numpy as np
import pandas as pd

In [14]:
dados = {
    "Nome": ["Ana", "Bruno", "Carla", "Daniel", "Eduardo", "Fernanda"],
    "Departamento": ["TI", "TI", "RH", "RH", "Vendas", "Vendas"],
    "Salario": [6000, 6000, 4000, 4200, 3000, 3500],
    "Estado": ["SP", "RJ", "SP", "RJ", "RJ", "SP"]
}

In [15]:
df = pd.DataFrame(dados)

In [16]:
df

       Nome Departamento  Salario Estado
0       Ana           TI     6000     SP
1     Bruno           TI     6000     RJ
2     Carla           RH     4000     SP
3    Daniel           RH     4200     RJ
4   Eduardo       Vendas     3000     RJ
5  Fernanda       Vendas     3500     SP

In [17]:
#CALCULAR A MEDIA POR GROUPY BY DEPARTAMENTO
df.groupby("Departamento")["Salario"].mean()

Departamento
RH        4100.0
TI        6000.0
Vendas    3250.0
Name: Salario, dtype: float64

In [18]:
#CALCULAR O VALOR MAX POR GROUPY BY DEPARTAMENTO
df.groupby("Departamento")["Salario"].max()

Departamento
RH        4200
TI        6000
Vendas    3500
Name: Salario, dtype: int64

In [19]:
#CALCULAR O VALOR MIN POR GROUPY BY DEPARTAMENTO
df.groupby("Departamento")["Salario"].min()

Departamento
RH        4000
TI        6000
Vendas    3000
Name: Salario, dtype: int64

In [20]:
#MEDIA SALARIAL POR ESTADO
df.groupby("Estado")["Salario"].mean()

Estado
RJ    4400.0
SP    4500.0
Name: Salario, dtype: float64

In [23]:
#FAZENDO GROUP BY DE VARIOS CALCULOS JUNTOS, MÃ‰DIA, MAXIMO, MINIMO, COUNT, VALORES UNICOS
df.groupby("Departamento").agg({"Salario": ["mean", "median", "max", "min", "count", "nunique"]})

             Salario
                mean  median   max   min count nunique
Departamento
RH            4100.0  4100.0  4200  4000     2       2
TI            6000.0  6000.0  6000  6000     2       1
Vendas        3250.0  3250.0  3500  3000     2       2

In [24]:
df.groupby("Estado").agg({"Salario": ["mean", "max", "median", "min"]})

       Salario
          mean   max  median   min
Estado
RJ      4400.0  6000  4200.0  3000
SP      4500.0  6000  4000.0  3500